server/libs/providers/FedEx/wsdl/TrackByNotification_Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v6="http://fedex.com/ws/track/v6">
<soapenv:Header/>
<soapenv:Body>
<v6:TrackNotificationRequest>
<v6:WebAuthenticationDetail>
<v6:UserCredential>
<v6:Key></v6:Key>
<v6:Password></v6:Password>
</v6:UserCredential>
</v6:WebAuthenticationDetail>
<v6:ClientDetail>
<v6:AccountNumber></v6:AccountNumber>
<v6:MeterNumber></v6:MeterNumber>
<v6:Localization>
<v6:LanguageCode>EN</v6:LanguageCode>
<v6:LocaleCode>EM</v6:LocaleCode>
</v6:Localization>
</v6:ClientDetail>
<v6:TransactionDetail>
<v6:CustomerTransactionId>Track By Notification Request</v6:CustomerTransactionId>  
</v6:TransactionDetail>
<v6:Version>
<v6:ServiceId>trck</v6:ServiceId>
<v6:Major>6</v6:Major>
<v6:Intermediate>0</v6:Intermediate>
<v6:Minor>0</v6:Minor>
</v6:Version>
<v6:TrackingNumber>800097415002141</v6:TrackingNumber>
<v6:TrackingNumberUniqueId>12010~800097415002141</v6:TrackingNumberUniqueId>
<v6:ShipDateRangeBegin>2010-12-27</v6:ShipDateRangeBegin>
<v6:ShipDateRangeEnd>2010-12-29</v6:ShipDateRangeEnd>
<v6:SenderEMailAddress>shriyash_khisti@syntelinc.com</v6:SenderEMailAddress>
<v6:SenderContactName>shriyash</v6:SenderContactName>
<v6:NotificationDetail>
<v6:PersonalMessage>HI!!</v6:PersonalMessage>
<v6:Recipients>
<v6:EMailNotificationRecipientType>SHIPPER</v6:EMailNotificationRecipientType>
<v6:EMailAddress>shriyash_khisti@syntelinc.com</v6:EMailAddress>
<v6:NotificationEventsRequested>ON_DELIVERY</v6:NotificationEventsRequested>
<v6:Format>TEXT</v6:Format>
</v6:Recipients>
</v6:NotificationDetail>
</v6:TrackNotificationRequest>
</soapenv:Body>
</soapenv:Envelope>